{
  "Footer": {
    "text_footer": "© Авторское право 2024 Документация Nurzhan. Все права защищены"
  },
  "Sidebar": {
    "started": "Начало работы",
    "1_sidebar": "Введение",
    "2_sidebar": "Установление",
    "3_sidebar": "Использование"
  },
  "Start": {
    "text1": "Установка",
    "text2": "Before you start using the weather app, make sure you have the following components installed:",
    "text3": "Веб-браузер",
    "text4": "Установка зависимостей",
    "text5": "Для установки зависимостей погодного приложения выполните следующие шаги:",
    "text6": "Откройте терминал или командную строку.",
    "text7": "Перейдите в каталог, содержащий файлы приложения.",
    "text8": "Выполните следующую команду:"
  },
  "Intro": {
    "title": "Введение",
    "paragraph": "Погодное приложение представляет собой веб-сайт, который отображает текущую погоду и прогноз на определенное количество дней. Для получения данных о погоде используется внешнее API."
  },
  "On": {
    "title": "Запуск приложения",
    "lol": "Чтобы запустить погодное приложение, выполните следующие шаги:",
    "text1": "Использование",
    "text2": "После запуска приложения вы увидите на главной странице текущую погоду и прогноз на ближайшие дни. Вы можете ввести название города или местоположение для получения погоды в конкретном регионе."
  },
  "Api": {
    "text": "Погодное приложение использует внешнее API для получения данных о погоде. Пожалуйста, обратитесь к документации API для получения дополнительной информации о доступных методах и параметрах.",
    "wha": "Прежде чем начать использовать API OpenWeatherMap, вам необходимо зарегистрироваться на их сайте и получить API-ключ. API-ключ используется для аутентификации запросов к сервису."
  },
  "documentation": {
    "websiteDocumentation": "Документация для веб-сайта по проекту на Python",
    "development": "Разработка",
    "contributionSteps": "Если вы хотите внести вклад в развитие погодного приложения, вот несколько шагов для начала:",
    "step1": "Клонируйте репозиторий с приложением с помощью команды git clone.",
    "step2": "Создайте новую ветку для вашей работы: git checkout -b feature/new-feature.",
    "step3": "Внесите необходимые изменения и коммиты.",
    "step4": "Отправьте свои изменения на сервер с помощью команды git push origin feature/new-feature.",
    "step5": "Создайте запрос на включение изменений PR(Pull Request) в основную ветку репозитория.",
    "githubLink": "Ссылка на github проекта",
    "clickHere": "Нажмите Сюда",
    "queryCityOrCoordinates": "q: Название города или координаты местоположения (широта и долгота).",
    "queryUnits": "units: Единицы измерения для температуры (стандартные, метрические или кельвины).",
    "queryLanguage": "lang: Язык, на котором будет возвращена информация о погоде (например, RU для русского языка).",
    "queryAPIKey": "APPID: Ваш API-ключ.",
    "texting": "Пример запроса:",
    "json": "Ответ API будет в формате JSON и содержать информацию о погоде для указанного города. Вы можете получить различные данные о погоде из ответа, такие как текущая температура, минимальная и максимальная температура и другие."
  }
}
